# 22-09-21 Wed
- 수업 빠져서 09-26에 동영상 강의 들었음

## 0 setting

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///db_univ7_new.db

In [3]:
%sql select * from sqlite_master;

 * sqlite:///db_univ7_new.db
Done.

[('table', 'classroom', 'classroom', 2, 'CREATE TABLE classroom\n\t(building\t\tvarchar(15),\n\t room_number\t\tvarchar(7),\n\t capacity\t\tnumeric(4,0),\n\t primary key (building, room_number)\n\t)'),
 ('index', 'sqlite_autoindex_classroom_1', 'classroom', 3, None),
 ('table', 'department', 'department', 4, 'CREATE TABLE department\n\t(dept_name\t\tvarchar(20), \n\t building\t\tvarchar(15), \n\t budget\t\t        numeric(12,2) check (budget > 0),\n\t primary key (dept_name)\n\t)'),
 ('index', 'sqlite_autoindex_department_1', 'department', 5, None),
 ('table', 'course', 'course', 6, 'CREATE TABLE course\n\t(course_id\t\tvarchar(8), \n\t title\t\t\tvarchar(50), \n\t dept_name\t\tvarchar(20),\n\t credits\t\tnumeric(2,0) check (credits > 0),\n\t primary key (course_id),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_course_1', 'course', 7, None),
 ('table', 'instructor', 'instructor', 8, 'CREATE TABLE instructor\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t salary\t\t\tnumeric(8,2) check (salary > 29000),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_instructor_1', 'instructor', 9, None),
 ('table', 'section', 'section', 10, "CREATE TABLE section\n\t(course_id\t\tvarchar(8), \n         sec_id\t\t\tvarchar(8),\n\t semester\t\tvarchar(6)\n\t\tcheck (semester in ('Fall', 'Win ... (285 characters truncated) ... (course_id)\n\t\ton delete cascade,\n\t foreign key (building, room_number) references classroom (building, room_number)\n\t\ton delete set null\n\t)"),
 ('index', 'sqlite_autoindex_section_1', 'section', 11, None),
 ('table', 'teaches', 'teaches', 12, 'CREATE TABLE teaches\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnum ... (125 characters truncated) ... ences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references instructor (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_teaches_1', 'teaches', 13, None),
 ('table', 'student', 'student', 14, 'CREATE TABLE student\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t tot_cred\t\tnumeric(3,0) check (tot_cred >= 0),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_student_1', 'student', 15, None),
 ('table', 'takes', 'takes', 16, 'CREATE TABLE takes\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnumer ... (153 characters truncated) ... ferences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_takes_1', 'takes', 17, None),
 ('table', 'advisor', 'advisor', 18, 'CREATE TABLE advisor\n\t(s_ID\t\t\tvarchar(5),\n\t i_ID\t\t\tvarchar(5),\n\t primary key (s_ID),\n\t foreign key (i_ID) references instructor (ID)\n\t\ton delete set null,\n\t foreign key (s_ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_advisor_1', 'advisor', 19, None),
 ('table', 'time_slot', 'time_slot', 20, 'CREATE TABLE time_slot\n\t(time_slot_id\t\tvarchar(4),\n\t day\t\t\tvarchar(1),\n\t start_hr\t\tnumeric(2) check (start_hr >= 0 and start_hr < 24),\n ... (111 characters truncated) ... >= 0 and end_hr < 24),\n\t end_min\t\tnumeric(2) check (end_min >= 0 and end_min < 60),\n\t primary key (time_slot_id, day, start_hr, start_min)\n\t)'),
 ('index', 'sqlite_autoindex_time_slot_1', 'time_slot', 21, None),
 ('table', 'prereq', 'prereq', 22, 'CREATE TABLE prereq\n\t(course_id\t\tvarchar(8), \n\t prereq_id\t\tvarchar(8),\n\t primary key (course_id, prereq_id),\n\t foreign key (course_id) references course (course_id)\n\t\ton delete cascade,\n\t foreign key (prereq_id) references course (course_id)\n\t)'),
 ('index', 'sqlite_autoindex_prereq_1', 'prereq', 23, None)]

## 1 integrity constraints
1. not null
2. primary key
3. unique
4. check(P): P를 만족해야함

In [4]:
%sql insert into section values ('BIO-101','1','Winter-Spring', 2018, 'Painter', '514', 'B')

 * sqlite:///db_univ7_new.db
(sqlite3.IntegrityError) CHECK constraint failed: semester in ('Fall', 'Winter', 'Spring', 'Summer')
[SQL: insert into section values ('BIO-101','1','Winter-Spring', 2018, 'Painter' , '514' , 'B' )]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [5]:
%sql insert into section values ('BIO-101','1','Winter', 2020, 'Painter', '514', 'B')

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [6]:
%sql insert into section values ('BIO-101','1','Winter', 2108, 'Painter', '514', 'B')

 * sqlite:///db_univ7_new.db
(sqlite3.IntegrityError) CHECK constraint failed: year > 1701 and year < 2100
[SQL: insert into section values ('BIO-101','1','Winter', 2108, 'Painter' , '514' , 'B' )]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [7]:
%sql select * from section

 * sqlite:///db_univ7_new.db
Done.

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', 2018, 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', 2017, 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', 2017, 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', 2017, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A'),
 ('BIO-101', '1', 'Winter', 2020, 'Painter', '514', 'B')]

In [8]:
%sql PRAGMA foreign_keys = ON;

 * sqlite:///db_univ7_new.db
Done.

[]

In [9]:
%sql select * from classroom

 * sqlite:///db_univ7_new.db
Done.

[('Packard', '101', 500),
 ('Painter', '514', 10),
 ('Taylor', '3128', 70),
 ('Watson', '100', 30),
 ('Watson', '120', 50)]

In [10]:
%sql delete from classroom where building='Painter' and room_number='514'

 * sqlite:///db_univ7.db
1 rows affected.

[]

In [11]:
%sql select * from classroom

 * sqlite:///db_univ7.db
Done.

[('Packard', '101', 500),
 ('Taylor', '3128', 70),
 ('Watson', '100', 30),
 ('Watson', '120', 50)]

In [10]:
%sql select * from section

 * sqlite:///db_univ7_new.db
Done.

[('BIO-101', '1', 'Summer', 2017, 'Painter', '514', 'B'),
 ('BIO-301', '1', 'Summer', 2018, 'Painter', '514', 'A'),
 ('CS-101', '1', 'Fall', 2017, 'Packard', '101', 'H'),
 ('CS-101', '1', 'Spring', 2018, 'Packard', '101', 'F'),
 ('CS-190', '1', 'Spring', 2017, 'Taylor', '3128', 'E'),
 ('CS-190', '2', 'Spring', 2017, 'Taylor', '3128', 'A'),
 ('CS-315', '1', 'Spring', 2018, 'Watson', '120', 'D'),
 ('CS-319', '1', 'Spring', 2018, 'Watson', '100', 'B'),
 ('CS-319', '2', 'Spring', 2018, 'Taylor', '3128', 'C'),
 ('CS-347', '1', 'Fall', 2017, 'Taylor', '3128', 'A'),
 ('EE-181', '1', 'Spring', 2017, 'Taylor', '3128', 'C'),
 ('FIN-201', '1', 'Spring', 2018, 'Packard', '101', 'B'),
 ('HIS-351', '1', 'Spring', 2018, 'Painter', '514', 'C'),
 ('MU-199', '1', 'Spring', 2018, 'Packard', '101', 'D'),
 ('PHY-101', '1', 'Fall', 2017, 'Watson', '100', 'A'),
 ('BIO-101', '1', 'Winter', 2020, 'Painter', '514', 'B')]

In [11]:
%sql select * from takes

 * sqlite:///db_univ7_new.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', 2017, 'B-'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [12]:
%sql delete from section where course_id='PHY-101' and sec_id='1' and semester='Fall' and year='2017'

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [13]:
%sql select * from takes

 * sqlite:///db_univ7_new.db
Done.

[('00128', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('00128', 'CS-347', '1', 'Fall', 2017, 'A-'),
 ('12345', 'CS-101', '1', 'Fall', 2017, 'C'),
 ('12345', 'CS-190', '2', 'Spring', 2017, 'A'),
 ('12345', 'CS-315', '1', 'Spring', 2018, 'A'),
 ('12345', 'CS-347', '1', 'Fall', 2017, 'A'),
 ('19991', 'HIS-351', '1', 'Spring', 2018, 'B'),
 ('23121', 'FIN-201', '1', 'Spring', 2018, 'C+'),
 ('45678', 'CS-101', '1', 'Fall', 2017, 'F'),
 ('45678', 'CS-101', '1', 'Spring', 2018, 'B+'),
 ('45678', 'CS-319', '1', 'Spring', 2018, 'B'),
 ('54321', 'CS-101', '1', 'Fall', 2017, 'A-'),
 ('54321', 'CS-190', '2', 'Spring', 2017, 'B+'),
 ('55739', 'MU-199', '1', 'Spring', 2018, 'A-'),
 ('76543', 'CS-101', '1', 'Fall', 2017, 'A'),
 ('76543', 'CS-319', '2', 'Spring', 2018, 'A'),
 ('76653', 'EE-181', '1', 'Spring', 2017, 'C'),
 ('98765', 'CS-101', '1', 'Fall', 2017, 'C-'),
 ('98765', 'CS-315', '1', 'Spring', 2018, 'B'),
 ('98988', 'BIO-101', '1', 'Summer', 2017, 'A'),
 ('98988', 'BIO-301', '1', 'Summer', 2018, None)]

In [14]:
%sql PRAGMA foreign_keys = ON;

 * sqlite:///db_univ7_new.db
Done.

[]

### referential integrity
- foreign key로 지정된 값이 해당 테이블에 없으면 error

In [15]:
%%sql
create table person (ID  char(10) primary key, name char(40), mother char(10), father char(10),spouse  char(10),
                    foreign key (father) references person)

 * sqlite:///db_univ7_new.db
Done.

[]

In [16]:
%sql insert into person values ('55555','me','11111','22222','66666')

 * sqlite:///db_univ7_new.db
(sqlite3.IntegrityError) FOREIGN KEY constraint failed
[SQL: insert into person values ('55555','me','11111','22222','66666')]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [17]:
%sql insert into person values ('55555','me','11111',null,'66666')

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [18]:
%sql insert into person values ('22222','myfather','00000',null,'11111')

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [20]:
%sql select * from person

 * sqlite:///db_univ7_new.db
Done.

[('55555', 'me', '11111', None, '66666'),
 ('22222', 'myfather', '00000', None, '11111')]

In [21]:
%sql update person set father = 22222 where ID=55555

 * sqlite:///db_univ7_new.db
1 rows affected.

[]

In [22]:
%sql select * from person

 * sqlite:///db_univ7_new.db
Done.

[('55555', 'me', '11111', '22222', '66666'),
 ('22222', 'myfather', '00000', None, '11111')]

### cascade
- delete cascade: 같이 삭제
- update cascade: 같이 업데이트

### set
- set null
- set default

subquery는 sqlite에서 지원 안함

In [23]:
%%sql create table section2
	(course_id		varchar(8), 
         sec_id			varchar(8),
	 semester		varchar(6)
		check (semester in ('Fall', 'Winter', 'Spring', 'Summer')), 
	 year			numeric(4,0) check (year > 1701 and year < 2100), 
	 building		varchar(15),
	 room_number		varchar(7),
	 time_slot_id		varchar(4) check (time_slot_id  in (select time_slot_id from time_slot)),
	 primary key (course_id, sec_id, semester, year),
	 foreign key (course_id) references course (course_id)
		on delete cascade,
	 foreign key (building, room_number) references classroom (building, room_number)
		on delete set null
	);

 * sqlite:///db_univ7_new.db
(sqlite3.OperationalError) subqueries prohibited in CHECK constraints
[SQL: create table section2
	(course_id		varchar(8),
         sec_id			varchar(8),
	 semester		varchar(6)
		check (semester in ('Fall', 'Winter', 'Spring', 'Summer')),
	 year			numeric(4,0) check (year > 1701 and year < 2100),
	 building		varchar(15),
	 room_number		varchar(7),
	 time_slot_id		varchar(4) check (time_slot_id  in (select time_slot_id from time_slot)),
	 primary key (course_id, sec_id, semester, year),
	 foreign key (course_id) references course (course_id)
		on delete cascade,
	 foreign key (building, room_number) references classroom (building, room_number)
		on delete set null
	);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [24]:
%%sql create table section2
	(course_id		varchar(8), 
         sec_id			varchar(8),
	 semester		varchar(6)
		check (semester in ('Fall', 'Winter', 'Spring', 'Summer')), 
	 year			numeric(4,0) check (year > 1701 and year < 2100), 
	 building		varchar(15),
	 room_number		varchar(7),
	 time_slot_id		varchar(4),
	 primary key (course_id, sec_id, semester, year),
	 foreign key (course_id) references course (course_id)
		on delete cascade,
	 foreign key (building, room_number) references classroom (building, room_number)
		on delete set null
	);

 * sqlite:///db_univ7_new.db
Done.

[]

- date
- time
- timestamp
- interval

## 2 SQL Data types and schemas

### user-defined types
유저 마음대로 type을 생성할 수 있다.

In [25]:
%sql create type Dollars as numeric (12,2) final;

 * sqlite:///db_univ7_new.db
(sqlite3.OperationalError) near "type": syntax error
[SQL: create type Dollars as numeric (12,2) final;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### user-defined domain

In [26]:
%sql create domain person_name char(20) not null;

 * sqlite:///db_univ7_new.db
(sqlite3.OperationalError) near "domain": syntax error
[SQL: create domain person_name char(20) not null;]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [27]:
%sql select * from sqlite_master;

 * sqlite:///db_univ7_new.db
Done.

[('table', 'classroom', 'classroom', 2, 'CREATE TABLE classroom\n\t(building\t\tvarchar(15),\n\t room_number\t\tvarchar(7),\n\t capacity\t\tnumeric(4,0),\n\t primary key (building, room_number)\n\t)'),
 ('index', 'sqlite_autoindex_classroom_1', 'classroom', 3, None),
 ('table', 'department', 'department', 4, 'CREATE TABLE department\n\t(dept_name\t\tvarchar(20), \n\t building\t\tvarchar(15), \n\t budget\t\t        numeric(12,2) check (budget > 0),\n\t primary key (dept_name)\n\t)'),
 ('index', 'sqlite_autoindex_department_1', 'department', 5, None),
 ('table', 'course', 'course', 6, 'CREATE TABLE course\n\t(course_id\t\tvarchar(8), \n\t title\t\t\tvarchar(50), \n\t dept_name\t\tvarchar(20),\n\t credits\t\tnumeric(2,0) check (credits > 0),\n\t primary key (course_id),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_course_1', 'course', 7, None),
 ('table', 'instructor', 'instructor', 8, 'CREATE TABLE instructor\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t salary\t\t\tnumeric(8,2) check (salary > 29000),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_instructor_1', 'instructor', 9, None),
 ('table', 'section', 'section', 10, "CREATE TABLE section\n\t(course_id\t\tvarchar(8), \n         sec_id\t\t\tvarchar(8),\n\t semester\t\tvarchar(6)\n\t\tcheck (semester in ('Fall', 'Win ... (285 characters truncated) ... (course_id)\n\t\ton delete cascade,\n\t foreign key (building, room_number) references classroom (building, room_number)\n\t\ton delete set null\n\t)"),
 ('index', 'sqlite_autoindex_section_1', 'section', 11, None),
 ('table', 'teaches', 'teaches', 12, 'CREATE TABLE teaches\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnum ... (125 characters truncated) ... ences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references instructor (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_teaches_1', 'teaches', 13, None),
 ('table', 'student', 'student', 14, 'CREATE TABLE student\n\t(ID\t\t\tvarchar(5), \n\t name\t\t\tvarchar(20) not null, \n\t dept_name\t\tvarchar(20), \n\t tot_cred\t\tnumeric(3,0) check (tot_cred >= 0),\n\t primary key (ID),\n\t foreign key (dept_name) references department (dept_name)\n\t\ton delete set null\n\t)'),
 ('index', 'sqlite_autoindex_student_1', 'student', 15, None),
 ('table', 'takes', 'takes', 16, 'CREATE TABLE takes\n\t(ID\t\t\tvarchar(5), \n\t course_id\t\tvarchar(8),\n\t sec_id\t\t\tvarchar(8), \n\t semester\t\tvarchar(6),\n\t year\t\t\tnumer ... (153 characters truncated) ... ferences section (course_id, sec_id, semester, year)\n\t\ton delete cascade,\n\t foreign key (ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_takes_1', 'takes', 17, None),
 ('table', 'advisor', 'advisor', 18, 'CREATE TABLE advisor\n\t(s_ID\t\t\tvarchar(5),\n\t i_ID\t\t\tvarchar(5),\n\t primary key (s_ID),\n\t foreign key (i_ID) references instructor (ID)\n\t\ton delete set null,\n\t foreign key (s_ID) references student (ID)\n\t\ton delete cascade\n\t)'),
 ('index', 'sqlite_autoindex_advisor_1', 'advisor', 19, None),
 ('table', 'time_slot', 'time_slot', 20, 'CREATE TABLE time_slot\n\t(time_slot_id\t\tvarchar(4),\n\t day\t\t\tvarchar(1),\n\t start_hr\t\tnumeric(2) check (start_hr >= 0 and start_hr < 24),\n ... (111 characters truncated) ... >= 0 and end_hr < 24),\n\t end_min\t\tnumeric(2) check (end_min >= 0 and end_min < 60),\n\t primary key (time_slot_id, day, start_hr, start_min)\n\t)'),
 ('index', 'sqlite_autoindex_time_slot_1', 'time_slot', 21, None),
 ('table', 'prereq', 'prereq', 22, 'CREATE TABLE prereq\n\t(course_id\t\tvarchar(8), \n\t prereq_id\t\tvarchar(8),\n\t primary key (course_id, prereq_id),\n\t foreign key (course_id) references course (course_id)\n\t\ton delete cascade,\n\t foreign key (prereq_id) references course (course_id)\n\t)'),
 ('index', 'sqlite_autoindex_prereq_1', 'prereq', 23, None),
 ('table', 'person', 'person', 26, 'CREATE TABLE person (ID  char(10) primary key, name char(40), mother char(10), father char(10),spouse  char(10),\n                    foreign key (father) references person)'),
 ('index', 'sqlite_autoindex_person_1', 'person', 27, None),
 ('table', 'section2', 'section2', 28, "CREATE TABLE section2\n\t(course_id\t\tvarchar(8), \n         sec_id\t\t\tvarchar(8),\n\t semester\t\tvarchar(6)\n\t\tcheck (semester in ('Fall', 'Wi ... (286 characters truncated) ... (course_id)\n\t\ton delete cascade,\n\t foreign key (building, room_number) references classroom (building, room_number)\n\t\ton delete set null\n\t)"),
 ('index', 'sqlite_autoindex_section2_1', 'section2', 29, None)]

## 3 index def(creation) in SQL

relation의 모든 record를 전부 스캔하는건 너무 비효율적이기 때문.
- create index [name] on [relation-name]([attribute])

In [28]:
%sql pragma index_list(instructor)

 * sqlite:///db_univ7_new.db
Done.

[(0, 'sqlite_autoindex_instructor_1', 1, 'pk', 0)]

In [30]:
%sql pragma index_info('sqlite_autoindex_instructor_1')

 * sqlite:///db_univ7.db
Done.

[(0, 0, 'ID')]

In [31]:
%sql create index instructorName_index on instructor (name)

 * sqlite:///db_univ7.db
Done.

[]

In [32]:
%sql pragma index_list(instructor)

 * sqlite:///db_univ7.db
Done.

[(0, 'instructorName_index', 0, 'c', 0),
 (1, 'sqlite_autoindex_instructor_1', 1, 'pk', 0)]

In [33]:
%sql drop index instructorName_index

 * sqlite:///db_univ7.db
Done.

[]